#!/bin/sh
set -eu

######################################################################
# 設定
######################################################################

print_usage_and_exit () {
  cat <<-USAGE 1>&2
	Usage   : ${0##*/} [終了コード]
	Options : -s

	引数で指定した終了コードで終了する。

	-sオプションで標準出力に終了コードの説明を出力する。
	USAGE
  exit 1
}

######################################################################
# パラメータ
######################################################################

# 変数を初期化
opr=''
opt_s='no'

# 引数をパース
i=1
for arg in ${1+"$@"}
do
  case "$arg" in
    -h|--help|--version) print_usage_and_exit ;;    
    -s*)                 opt_s=${arg#-s}      ;;
    *)
      if [ $i -eq $# ] && [ -z "$opr" ]; then
        opr=$arg
      else
        echo "${0##*/}: invalid args" 1>&2
        exit 11
      fi
      ;;
  esac

  i=$((i + 1))
done

# 有効な数値であるか判定
if ! printf '%s\n' "$opr" | grep -Eq '^[0-9]+$'; then
  echo "${0##*/}: \"$opr\" invalid number" 1>&2
  exit 21
fi

# パラメータを決定
ecode=$opr
isstdout=$opt_s

######################################################################
# 本体処理
######################################################################

if [ "$isstdout" == 'yes' ]; then
  printf "exit code = %d\n" "$ecode"
fi

exit "$ecode"
